app/Controllers/Home.php

    public function index()
    {
        $blogsModel = new BlogModel();
        $blogs = $blogsModel->where('status', 'published')->findAll(3);

        $testimonialModel = new TestimonialModel();
        $testimonials = $testimonialModel->findAll(9);
---
SELECT *
FROM `testimonial`
 LIMIT 9